xml/xml-z-py-moj.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:ns3="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ns1="http://www.w3.org/2001/XMLSchema"
    xmlns:ns2="setProducts"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <SOAP-ENV:Header/>
    <ns0:Body>
        <ns2:setProducts>
            <setProducts xsi:type="ns2:requestType">
                <authenticate xsi:type="ns2:authenticateType">
                    <system_key xsi:type="ns1:string">dad6017229881610c4d8e1c0954f3d58d5fda92d</system_key>
                    <system_login xsi:type="ns1:string">API_login</system_login>
                </authenticate>
                <params xsi:type="ns2:paramsType">
                    <settings xsi:type="ns2:settingsType">
                        <modification_type xsi:type="ns1:string">edit</modification_type>
                    </settings>
                    <products xsi:type="ns2:productsType" ns3:arrayType="ns2:productType[1]">
                        <item xsi:type="ns2:productType">
                            <id xsi:type="ns1:int">1175014091</id>
                            <retail_price xsi:type="ns1:float">22.5</retail_price>
                            <sizes xsi:type="ns2:sizesType" ns3:arrayType="ns2:sizeType[1]">
                                <item xsi:type="ns2:sizeType">
                                    <size_id xsi:type="ns1:string">uniw</size_id>
                                    <quantity xsi:type="ns2:quantityType">
                                        <stocks xsi:type="ns2:stocksType" ns3:arrayType="ns2:stockType[2]">
                                            <item xsi:type="ns2:stockType">
                                                <stock_id xsi:type="ns1:int">1</stock_id>
                                                <quantity xsi:type="ns1:decimal">10</quantity>
                                            </item>
                                            <item xsi:type="ns2:stockType">
                                                <stock_id xsi:type="ns1:int">2</stock_id>
                                                <quantity_add xsi:type="ns1:decimal">5</quantity_add>
                                            </item>
                                        </stocks>
                                    </quantity>
                                </item>
                            </sizes>
                        </item>
                    </products>
                </params>
            </setProducts>
        </ns2:setProducts>
    </ns0:Body>
</SOAP-ENV:Envelope>
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ns1="setProducts"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <SOAP-ENV:Body>
        <ns1:setProductsResponse>
            <response xsi:type="ns1:responseType">
                <authenticate xsi:type="ns1:authenticateType">
                    <system_key xsi:type="xsd:string">dad6017229881610c4d8e1c0954f3d58d5fda92d_iai</system_key>
                </authenticate>
                <errors xsi:type="ns1:errorsType">
                    <faultCode xsi:type="xsd:int">0</faultCode>
                    <faultString xsi:type="xsd:string"></faultString>
                </errors>
                <result xsi:type="ns1:resultType">
                    <products SOAP-ENC:arrayType="ns1:productResultType[1]" xsi:type="ns1:productsResultType">
                        <item xsi:type="ns1:productResultType">
                            <product_id xsi:type="xsd:int">1175014091</product_id>
                            <faultCode xsi:type="xsd:int">5</faultCode>
                            <faultString xsi:type="xsd:string">Dodawanie produktów zostało zablokowane w ustawieniach wywołania</faultString>
                            <details SOAP-ENC:arrayType="ns1:detailResultType[1]" xsi:type="ns1:detailsResultType">
                                <item xsi:type="ns1:detailResultType">
                                    <stock_id xsi:type="xsd:int">0</stock_id>
                                    <quantity xsi:type="xsd:int">0</quantity>
                                    <operation_type xsi:type="xsd:string"></operation_type>
                                    <faultCode xsi:type="xsd:string">5</faultCode>
                                    <faultString xsi:type="xsd:string">Dodawanie produktów zostało zablokowane w ustawieniach wywołania</faultString>
                                </item>
                            </details>
                        </item>
                    </products>
                </result>
            </response>
        </ns1:setProductsResponse>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>